 --[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀ 
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY Bakury                         ▀▄ ▄▀ 
▀▄ ▄▀     BY Bakury (@illOlli)             ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY Bakury                ▀▄ ▄▀ 
▀▄ ▄▀          dev1  : dev                 ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀ 
--]] 
do 

function run(msg, matches) 
return [[ 

االبوت الذي يعمل على مجوعات السوبر 🔸 

يعمل البوت على مجموعات سوبر تصل الى5k عضو 🔷 

     ≪تم صنع البوت بواسطة المطور≫ 
                      『 @illOlli』 
    🔹#Dev :- Bakury🔹 
]] 
end 

return { 
description = "Shows bot q", 
usage = "spam Shows bot q", 
patterns = { 
"$(المطور )" 
}, 
run = run 
} 
end 
