--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀ 
▀▄ ▄▀                                       ▀▄ ▄▀ 
▀▄ ▄▀       BY Taemnew              ▀▄ ▄▀ 
▀▄ ▄▀ BY TAEMNEW()          ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY TAEMNEW        ▀▄ ▄▀ 
▀▄ ▄▀          مساعدة 3                    ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀ 
--]] 
do 

function bakury(msg, matches) 
local reply_id = msg['id'] 
local S = [[ 
📍💭 اوامر حماية المجموعة 🀄️ 

🔐 "قفل / فتح" الاضافه :التحكم بالاضافه داخل المجموعه) 
🔐 "قفل / فتح" الدردرشه :التحكم بالدردشه داخل المجموعه) 
🔐 "قفل / فتح" الملصقات :التحكم بالملصقات داخل المجموعه) 
🔐 "قفل / فتح" الروابط :التحكم بلروابط داخل المجموعه) 
🔐 "قفل / فتح" البوتات :لتحكم بلبوتات داخل المجموعه) 💎
➖⚓➖⚓➖⚓➖⚓➖⚓➖⚓➖⚓➖⚓➖ 
🛡 "قفل / فتح" اعاده توجيه :التحكم باعادة التوجيه في المجمو 🔐
  🔐 "قفل / فتح" البوتات :التحكم بالبوتات في المجموعه.      ?
      🛡 "قفل / فتح" الكلايش:التحكم بالكلايش داخ المجموعه🔐
      🛡 "قفل / فتح" التكرار :التحكم في التكرار المجموعه 🔐 
      🛡 "قفل / فتح" العربيه :التحكم باللغه داخل المجموعه 🔐 
  🛡 "قفل / فتح" جهات الاتصال :التحكم بالجهات في المجموعه 🔐 
➖🚨➖🚨➖🚨➖🚨➖🚨➖🚨 
⚓-DEV💀:  
⚓-ĐEV BOT💀: @Twsl_devbot
⚓-Đєⱴ Ϲḫ₳ͷͷєℓ💀: 
]] 
reply_msg(reply_id, S, ok_cb, false) 
end 

return { 
description = "Help list", 
usage = "Help list", 
patterns = { 
"^(م3)$", 
}, 
run = Bakury 
} 
end  