--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀ 
▀▄ ▄▀                                       ▀▄ ▄▀ 
▀▄ ▄▀       BY bakury              ▀▄ ▄▀ 
▀▄ ▄▀ BY TAEMNEW(@illOlli)          ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY TAEMNEW        ▀▄ ▄▀ 
▀▄ ▄▀            مساعدة 1                 ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀ 
--]] 
do 

local function bakury(msg, matches) 
local reply_id = msg['id'] 
if is_momod(msg) and matches[1]== 'م1' then 
local S = [[🔨اوامر حمايه المجموعه🔐
  ?🔐💡💡💡💡💡       [[ 
♻ رفع ادمن : لرفع ادمن في المجموعه 
♻ تنزيل ادمن : لتنزيل ادمن في المجموعه 
♻ الادمنيه :  لعرض ادمنيه المجموعه 
 ➖♥➖♥➖♥➖♥➖♥➖♥➖♥
⚠اوامــر مخـصــصه للادمــن ⚠   

🎭 حظر :لحظر وطرد عضو من المجموعه  
🎭 الغاء الحظر :لالغاء الحظر عن عضو.   
🎭 منع :لمنع كلمه داخل المجموعه      
🎭 الغاء منع :لالغاء منع كلمه داخل المجموعه
💎➖💎➖💎➖💎➖💎➖💎➖💎➖💎 
♥ قفل الوسائط :لقفل جميع الوسائط 
♥ فتح الوسائط :فتح جميع الوسائط 
➖🌹➖🌹➖🌹➖🌹➖🌹➖🌹
💀 كتم بالرد : لكتم عضو بواسطة الرد
💀 ايدي :لعرض ايدي المجموعه.    
💀 ايدي بالرد :لعرض ايدي العضو.  
 ➖♻➖♻➖♻➖♻➖♻➖♻ 
💯-DEV🎭:@illOlli 
💯-Đєv ฿๏t🎭: @Twsl_devbot
💯-ĐєⱴϹḫ₳ͷͷєt 🎭: @ 
]] 
reply_msg(reply_id, S, ok_cb, false) 
end 

if not is_momod(msg) then 
local S = "ابني موشغلك ليش تلعب بعدك اصغير 😹😍" 
reply_msg(reply_id, S, ok_cb, false) 
end 

end 
return { 
description = "Help list", 
usage = "Help list", 
patterns = { 
"^(م1)$", 
}, 
run = Bakury 
} 
end 
