 do 

function run (msg, matches) 

local reply_id = msg ['id'] 
if matches[1]==  'الاوامر' and is_momod(msg) then 
local leloo = [[ ⚡️TAEMNEW⚡️ 

📌🔶➖🔶➖🔷➖🔶➖🔷📌 
م1♥عرض اوامر الترقية 
م2♥عرض الاوامر العامة 
م3♥عرض البانهمر للطرد 
م4♥ْعرَضُ اوَامٌرَ الُتْنَظٌيَف 
م5♥ْعرَضُ اوَامٌرَ الُمٌيَدِيـا 
📌🔶➖🔶➖🔷➖🔶➖🔷📌 
Made By 🔹@Th2_BOOS 
reply_msg(reply_id, leloo, ok_cb, false) 
end 
local reply_id = msg ['id'] 
if matches[1]== 'help' and not is_momod(msg) then 
    local omar = 'للمشرفين فقط' 
    reply_msg(reply_id, leloo, ok_cb, false) 
    end 
local reply_id = msg ['id'] 
if matches[1]==  'help4' and is_momod(msg) then 
local help4 = [[📜 ⚡️TAEMNEW⚡️ 
🔆✨✨✨✨✨✨✨✨🔆 
📱 (ضع صوره) لوضع صوره في المجموعة☢ 
📱 (ضع معرف) لوضع معرف في المجموعة☢ 
📱 (ضع قوانين) لوضع قوانين في المجموعة☢ 
📱 (ضع وصف) لوضع وصف في المجموعة☢ 
📱 (ضع اسم) لوضع اسم في المجموعة☢ 
♣️✨✨✨✨✨✨✨✨♣️ 
Made By 🔹@Th2_BOOS 
reply_msg(reply_id, help4, ok_cb, false) 
end 
local reply_id = msg ['id'] 
if matches[1]== 'hel4' and not is_momod(msg) then 
    local help = 'للمشرفين فقط' 
    reply_msg(reply_id, help, ok_cb, false) 
    end 
local reply_id = msg ['id'] 
if matches[1]==  'help3' and is_momod(msg) then 
local help3 = [[ 📜 ⚡️TAEMNEW⚡️ 
🔘 ☁️☁️☁️☁️☁️☁️☁️ 
⌛ (طرد)+ معرف لطرد عضو في المجموعة☢ 
⌛ (حضر)+ معرف لحضر عضو في المجموعة☢ 
⌛ (الغاء الحضر)+ المعرف لالغاء الحضر في المجموعة☢ 
⌛ (منع)+ الكلمه لمنع كلمة في المجموعة☢ 
⌛ (الغاء المنع)+ الكلمة لالغاء حضر الكلمة في المجموعة☢ 
⌛ (حضر العام)+ المعرف لحضر عام لعضو في المجموعة☢ 
⌛ (الغاء حضر العام)+ المعرف لالغاء حضر عام لعضو في المجموعة☢ 
⏰ ☁️☁️☁️☁️☁️☁️☁️ 
🔕 (قائمه المحضورين عام) لاضهار قائمة المحضورين عام☢ 
🔕 (المكتومين) لاضهار المكتومين في المجموعة☢ 
⏰ ☁️☁️☁️☁️☁️☁️☁️ 
Made By 🔹@Th2_BOOS 
reply_msg(reply_id, help3, ok_cb, false) 
end 

local reply_id = msg ['id'] 
if matches[1]==  'help5' and is_momod(msg) then 
local help5 =[[📜 ⚡️TAEMNEW⚡️ 

🔶 اوامر قفل وسائظ المجموعة 🔒✅ 

🔶 (قفل الروابط) لقفل الروابط🔐 
🔶 (قفل الصور) لقفل الصور🔐 
🔶 (قفل الحماية) لقفل الحماية🔐 
🔶 (قفل البوتات) لقفل البوتات🔐 
🔶 (قفل الصوت) لقفل الصوت🔐 
🔶 (قفل الاضافه) لقفل الاضافه🔐 
🔶 (قفل الملصقات) لقفل الملصقات🔐 
🔶 (قفل جهات الاتصال) 🔐 
🔶 (قفل الالتكرار) لقفل التكرار🔐 
🔶 (قفل الكلايش) لقفل الكلايش🔐 
🔶 (قفل الفديو) لقفل الفديو🔐 
🔶 (قفل الدردشه) لقفل الدردشه🔐 
🔶 (قفل الكل) لقفل الكل🔐 
🔶 (قفل التوجيه) لقفل التوجيه🔐 
🔶 (قفل الوسائط) لقفل الوسائط🔐 

💯•••••••••••••••••••••••••••••••💯 
🔶 اوامر الفتح وسائط المجموعة 🔓✅ 

🔶 (فتح الروابط) لفتح الروابط🔓 
🔶 (فتح الصور) لفتح الصور🔓 
🔶 (فتح الحماية) لفتح الحماية 🔓 
🔶 (فتح البوتات) لفتح البوتات🔓 
🔶 (فتح الصوت) لفتح الصوت🔓 
🔶 (فتح الاضافة) لفتح اضافة🔓 
🔶 (فتح الملصقات) لفتح الملصقات🔓 
🔶 (فتح جهات الاتصال) 🔓 
🔶 (فتح التكرار) لفتح التكرار🔓 
🔶 (فتح الكلايش) لفتح الكلايش🔓 
🔶 (فتح الفديو) لفتح الفديو🔓 
🔶 (فتح الدردشه) لفتح الدردشه🔓 
🔶 (فتح الكل) لفتح الكل🔓 
🔶 (فتح التوجيه) لفتح اعاده توجيه🔓 
🔶 (فتح الوسائط) لفتح الوسائط🔓 

Made By 🔹@Th2_BOOS 
reply_msg(reply_id, help5, ok_cb, false) 
end 

local reply_id = msg ['id'] 
if matches[1]==  'help2' and is_momod(msg) then 
local help2 = [[📜 ⚡️TAEMNEW⚡️ 
🕤➖➖➖➖➖➖➖➖🕤 
🔷 (القوانين) لاضهار قوانين المجموعة🎭 
🔷 (الوصف) لاضهار وصف المجموعة🎭 
🔷 (المطور) لمعرفة المطور🎭 
🔷 (الاصدار) لمعرفة اصدار البوت🎭 
🔷 (معلوماتي) لاضهار معلوماتك🎭 
🔷 (معلومات المجموعه) لاضهار معلومات المجموعه🎭 
🔷 (ضع رابط) لرضع رابط في المجموعة🎭 
🔷 (الرابط) لاضهار الرابط الخاص بالمجموعة🎭 
🔷 (الرابط خاص) ارسال الرابط الى الخاص🎭 
🔷 (الاعدادات) لاضهار اعدادات المجموعة🎭 
🔷 (اعدادات الوسائط) لاضهار الاعدادات الثانويه🎭 
🎗➖➖➖➖➖➖➖➖🎗 
Made By 🔹@Th2_BOOS 
reply_msg(reply_id, help2, ok_cb, false) 
end 

local reply_id = msg ['id'] 
if matches[1]==  'help1' and is_momod(msg) then 
local help1 = [[📜 ⚡️TAEMNEW⚡️ 
✔〰〰〰〰〰〰〰〰✔ 
📛 (رفع المدير) لرفع مدير في المجموعة☢ 
📛 (رفع ادمن) لرفع ادمن في المجموعة☢ 
📛 (رفع اداري) لرفع اداري في المجموعة☢ 
📛 (تنزيل اداري) لتنزيل اداري في المجموعة☢ 
📛 (تنزيل ادمن) لتنزيل ادمن في المجموعة☢ 
📛 (الادمنيه) لعرض ادمنيه المجموعة☢ 
📛 (المدير) لعرض مدير المجموعة☢ 
✔〰〰〰〰〰〰〰〰✔ 
Made By 🔹@Th2_BOOS 
reply_msg(reply_id, help1, ok_cb, false) 
end 
end 
return { 
patterns = { 
"^[!/#](help)$", 
"^[!/#](مساعدة)$", 
"^(م4)$", 
"^(م3)$", 
"^(م5)$", 
"^(م2)$", 
"^(م1)$", 
}, 
run = run 
} 
end 
