 --[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀ 
▀▄ ▄▀                                       ▀▄ ▄▀ 
▀▄ ▄▀       BY TAEMNEW              ▀▄ ▄▀ 
▀▄ ▄▀ BY TAEMNEW (@illOlli)          ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY TAEMNEW        ▀▄ ▄▀ 
▀▄ ▄▀           مساعدة4                     ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀ 
--]] 
do 

function bakury(msg, matches) 
local reply_id = msg['id'] 
local S = [[ 
📍💭 اوامر فتح وقفل الميديا 🀄️ 

❄️"قفل / فتح" الفيديو :التحكم بالفيديو داخل المجموعه).    
❄️"قفل / فتح" الصوت :التحكم بالصوت داخل المجموعه).    
❄️"قفل / فتح" الصور :التحكم بالصور داخل المجموعه)      
❄️"قفل / فتح" الملصقات :فتح وقفل الملصقات في المجموعه)  
❄️"قفل / فتح" الجماعيه :التحكم بالجماعيه داخل المجموعه)    
❄️"قفل / فتح" الصور المتحركه : فتح وقفل الملصقات المتحركه) 
ـ🔸➖🔹➖🔸➖🔹➖🔸ـ 
📍💭 اوامر اضافيه 
🔥صوره : ↭↜ (لتحويل الملصق الى صوره) 
🔥ملصق : ↭↜ (لتحويل الصوره الى ملصق) 
➖💎➖💎➖💎➖💎➖💎➖💎➖💎 
💯-ĐEV💀: @illOlli 
💯-ĐEV BOT: @Twsl_devbot 
💯-ĐEV Ϲḫ₳ͷͷєℓ💀: 
 ]] 
reply_msg(reply_id, S, ok_cb, false) 
end 

return { 
description = "Help list", 
usage = "Help list", 
patterns = { 
"^(م4)$", 
}, 
run = BAKER
} 
end 
