 -- made by { @TH3BOSS } 
do 
ws = {} 
rs = {} 

-- some examples of how to use this :3 
ws[1] = "هلاو" -- msg 
rs[1] =  "هلاوو99وووات نورت/ي ❤️🙈" -- reply 

ws[2] = "بكر" -- msg 
rs[2] = "هذا الي صنعني فديت ربه 🙈❤️" -- reply 

ws[3] = "شلونكم" -- msg 
rs[3] = "اني بالنسبة اليه دايح شوف بقيه الاعضااء 😂🖕" -- reply 

ws[4] = "ضوجة" -- msg 
rs[4] = "شي اكيد الكبل ماكو 😂 لو بعدك/ج مازاحف/ة 🙊😋" -- reply 

ws[5] = "هلو" -- msg 
rs[5] = "🌹 هــلــℌelℓoووات🌹عمـ°🌺°ــري🙊😋" -- reply 

ws[6] = "بوسني" -- msg 
rs[6] = "💋😍ممَمَِمَِمَِمَِمِمِحَ تشَلع شَفتَي🙈😘🙊😋" -- reply 

ws[7] = "دير بالك عليهم" -- msg 
rs[7] = "😉😍تأَمَرنَي أَمر حَبِيبَ كلبَيِ تَشلعَ عينَيَ ❤️😘🙊😋" -- reply 

ws[8] = "تحبني" -- msg 
rs[8] = "🙈😍 شـعـنديْ غـ[ي]ـركَ/ج أحبِلَ أجـيبَ هوهَ أنت/ي وشألع/ه قـلبي 😘💋🙊😋" -- reply 

ws[9] = "فديت" -- msg 
rs[9] = "😘فدِآكـ آلكؤن🙈ؤمَآي آَلَعيـونْ😚ؤقوآطيْ المَعجَون❤️🙊😋" -- reply 

ws[10] = "برب" -- msg 
rs[10] = "😉أخَذَ/ي رآَحَتكَ 👍🏼حبَيَبَ كلَبي😘️🙊😋" -- reply 

ws[11] = "😒" -- msg 
rs[11] = "😒شبيـــك /ج كـــالــب/ه 😡 خلقتـــك/ج ســـربـــوت/ه😒🌚" -- reply 

ws[12] = "اني" -- msg 
rs[12] = "انت🌚 واحــد😒 ملطلـــط😡مــــا تكعـــد وتسكت😂😘" -- reply 

ws[13] = "رنا" -- msg 
rs[13] = "هاي حبيبت الصنعني فديت ربهة😘😍" -- 

ws[14] = "تخليني" -- msg 
rs[14] = "😅المكـــان عليـــك👆لــو عــلــي👈😏" -- reply 

ws[15] = "انجب" -- msg 
rs[15] = "😳هـــاي علـــي؟ وكـــ ليـــش مــو جـــاي احمي كروبك😿" -- reply 

ws[16] = "كلخره" -- msg 
rs[16] = "😈ايا منحرف/ه ايا سربـــوت/ه/😒" -- reply 

ws[17] = "😕" -- msg 
rs[17] = "عـــاوج حلكَك عليمــن اتعدله لو اعدلــه الــك😒" -- reply 

ws[18] = "احبك" -- msg 
rs[18] = "موت بيك/ج ڳـــلـبْɧèāȑŧـي.😘" -- reply 

ws[19] = "صخام" -- msg 
rs[19] = "😡بــوجــهــك😏مـلـطــلط😒" -- reply 

ws[20] = "بنيه" -- msg 
rs[20] = "😏واذا بــنــيــه🌚 مـــا تشـــوفــيـن😒 شــون الله مطـيــح حظج😈" -- reply 

ws[21] = "انت ياهو يمك" -- msg 
rs[21] = "😏كــبــر🌚 را ســـك😒 وكـمــت تتعيقل علي😈" -- reply 

ws[22] = "تحب جوجو" -- msg 
rs[22] = "لك أّمُِـٍْـّْწყღწــًوت عليه احبه اكثر منك😼💔" -- reply 

ws[23] = "لابو ابوكم لابو تي ان تي" -- msg 
rs[23] = "انجب حشري🍃😹" -- reply 

ws[24] = "هههه" -- msg 
rs[24] = "😘❤️دووووم ❤️الضحكه 😂🙈" -- reply 

ws[25] = "😳" -- msg 
rs[25] = "🌚شـبــيــك😒مصـــدوم🌝وجـــه التنــكـــه😏" -- reply 

ws[26] = "حموده" -- msg 
rs[26] = "❤️فـــطــيــت😘ضــحـــكـتــك😍خخخخ❤️" -- reply 

ws[27] = "قاسم" -- msg 
rs[27] = "اخـہـخ 😨 صـہـاككے اڵـہـكڕۆب 🙈 ۿـہـۮا 🏻️  💜😻" -- reply 

ws[28] = "مرحبا" -- msg 
rs[28] = "😻مـــراحــب😘عم🌺ري🤓" -- reply 

ws[29] = "قزوم" -- msg 
rs[29] = "صـ😻ــاك الكـgяθυρـٍْـْْروب 🌚🌹" -- reply 

ws[30] = "سطورة" -- msg 
rs[30] = "صـ😻ــاكره الكـgяθυρـٍْـْْروب 🌚🌹" -- reply 

ws[31] = "بيبو" -- msg ء سثس4ء سثس4 
rs[31] = "مــعـ😻ــذب الكـgяθυρـٍْـْْروب 🌚🌹" -- replyءق يلائ  ءق ي 

ws[32] = "صادق" -- msg 
rs[32] = "صـ😻ــاك الكـgяθυρـٍْـْْروب 🌚🌹" -- reply 

ws[33] = "🍃😹" -- msg 
rs[33] = "😹داحــســـك😹بــزونـــه😹" -- reply 

ws[34] = "اندعيلي" -- msg 
rs[34] = "كـــون تــمــوت😈🌚" -- reply 

ws[35] = "امريكي" -- msg 
rs[35] = "مــجــنــنـ😻كــم فــــ❤️يـــتـــه 🌚🌹" -- reply 

ws[36] = "حيدوري" -- msg 
rs[36] = "😅يــمـــه😂 الـــحـــب❤️  يــمـــه😘" -- reply 

ws[37] = "منتظر" -- msg 
rs[37] = "نظوري نوتيلا والباقي نستله ام الربع😻🍃" -- reply 

ws[38] = "عمروش" -- msg 
rs[38] = "مــجــنــنـ😻كــم فــــط❤️يـــتـــه 🌚🌹" -- reply 

ws[39] = "صفا" -- msg 
rs[39] = "😍صفاوي نوتيلا والباقي نستله ام الربع😻🍃" -- reply 

ws[40] = "نستله" -- msg 
rs[40] = "😋ايــبـــاه🎈نـــــوبــه 🐹بــس مــال🎈 اكــل😋" -- rep 

ws[41] = "تمام" -- msg 
rs[41] = "⌣{دِْۈۈۈۈ/يّارٌبْ_مـْو_يـّوّمٌ/ۈۈۈۈمْ}⌣" -- rep 

ws[42] = "دوم" -- msg 
rs[42] = "⌣{يـّـٌدِْۈۈ/عّزٌگ-ۈنَبْضّ قَلبْگ/ۈۈمْ}⌣" -- rep 

ws[43] = "منور" -- msg 
rs[43] = "نِْـِْـــِْ([💡])ِْــــًِـًًْـــِْـِْـِْـورِْكِْ" -- rep 

ws[44] = "ها" -- msg 
rs[44] = "هاي اچون چقله هاي🌚" -- rep 

ws[45] = "شكرا" -- msg 
rs[45] = "{ •• الـّ~ـعـفو •• }" -- rep 

ws[46] = "وينك" -- msg 
rs[46] = "بالــســ🚗ــيــارﮭﮧ" -- rep 

ws[47] = "انته وين" -- msg 
rs[47] = "بالــبــ🏠ــيــت" -- rep 

ws[48] = "وين" -- msg 
rs[48] = "بالــســ🚗ــيــارﮭﮧ" -- rep 

ws[49] = "بوسه" -- msg 
rs[49] = "امــہـ😘😚😘😚😘ــہــواااااح" -- rep 

ws[50] = "السلام عليكم" -- msg 
rs[50] = "ۆعلـِْ♡̨̐ـِْيگمَ آلسَـِْ♡̨̐ـِْامَ" -- reply 

ws[51] = "طن" -- msg 
rs[51] = "كش عاع🌚️🏻" -- reply 

ws[52] = "زاحف" -- msg 
rs[52] = "زاحف ع اختك مثلا🏽️" -- reply 

ws[53] = "اتفل" -- msg 
rs[53] = "خخخخـ😩ـخخخ تفـ💦ـووووو💦💦" -- reply 

ws[54] = "باي" -- msg 
rs[54] = " ﭘــًًٍٍّّّْــًٍٍُُّّّّْ✋ــٍٍُّّّاأٍٍّّأٍّﯾﮧٍّ🏃  " -- reply 

ws[55] = "بوت" -- msg 
rs[55] = "مازا تريد منه🙄🍃" -- reply 

ws[56] = "اتفل" -- msg 
rs[56] = "خخخخـ😩ـخخخ تفـ💦ـووووو💦💦" -- reply 

ws[57] = "علي" -- msg 
rs[57] = "مــجــنــنـ😻كــم فــــ❤️يـــتـــه 🌚🌹" -- reply 

ws[58] = "عمر" -- msg 
rs[58] = "اخـہـخ 😨 صـہـاككے اڵـہـكڕۆب 🙈 ۿـہـۮا 🏻️  💜😻" -- reply 

ws[59] = "سامو" -- msg 
rs[59] = "اشـش كــــول عــــمــــو ســامــو 🌚🚶🏻" -- reply 

ws[60] = "علشلش" -- msg 
rs[60] = "العشق فديت ربه 🌚🚶🏻" -- reply 

ws[60] = "حمودي" -- msg 
rs[61] = "العشق مالتي يعني الصنعني فديته❤️" -- reply 

ws[62] = "ّ" 
rs[62] =  "ّ" 

ws[63] = "ّ" -- msg 
rs[63] = "ّ️" -- reply 

ws[64] = "شلونكم" -- msg 
rs[64] = "الحمدلله وانته 🌚🍃" -- reply 

ws[65] = "دووم" -- msg 
rs[65] = "يدوم نبضك ❤️🍃" -- reply 

ws[66] = "شونك" 
rs[66] = "الحمدلله وانته" 

ws[67] = "شلونك" 
rs[67] = "الحمدلله وانته" 

ws[68] = "غنيلي" 
rs[68] = " 🙈 احبك اني  🙊 اني احبك 🙉 واتحدى واحد بلبشر مثلي يحبك 🙊" 

ws[69] = "شغل المبردة" 
rs[69] = " تم تشغيل المبردة بنجاح ❄️" 

ws[70] = "طفي المبردة" 
rs[70] = "طفيتهه 😒🍃" 

ws[71] = "شغل السبلت" 
rs[71] = "شغلته 🌚🍃 بس حثلجون معليه ترا " 

ws[72] = "مايا خليفه" 
rs[72] = " 😂 عيب صايمين" 

ws[73] = "فطور" 
rs[73] = "واخيراً 😍😍 خل اروح افطر " 

ws[74] = "ّ" 
rs[74] = "ّ" 

ws[75] = "ّ" 
rs[75] = "ّ  " 

ws[76] = "تخليني" 
rs[76] = " 😂 يي امين ابدي " 

ws[77] = "زاحففف" 
rs[77] = "😂🌚 هاي عود انته جبير" 

ws[78] = "تركيا" 
rs[78] = "😐🍃 فديتهه" 

ws[79] = "داعش" 
rs[79] = "دي خل يولون 😒❤️" 

ws[80] = "الدولة الاسلامية" 
rs[80] = "انته داعشي ؟؟ 😒💔" 

ws[81] = "سني" 
rs[81] = "لتصير طائفي 😒🖐" 

ws[82] = "شيعي" 
rs[82] = "لتصير طائفي 😕" 

ws[83] = "تبادل" 
rs[83] = "كافي ملينه 😒😒 ما اريد اتبادل" 

ws[84] = "العراقيين" 
rs[84] = "احلى ناس ولله 😍🙈" 

ws[85] = "من وين" 
rs[85] = "شعليك زاحف 😂🔥 " 

ws[86] = "هاي" 
rs[86] = "هايات 🙈🍷" 

ws[87] = "البوت" 
rs[87] = "معاجبك ؟ 😕😒🍃" 

ws[88] = "البوت واكف" 
rs[88] = "لتجذب 😒" 

ws[89] = "منو ديحذف رسائلي" 
rs[89] = "محد 😐🍃" 

ws[90] = "كلاش اوف كلانس" 
rs[90] = "تلعبهه ؟ شكد لفلك ؟" 

ws[91] = "جوني" 
rs[91] = "😂 مأذيك ؟" 

ws[92] = "ازحف " 
rs[92] = " على اختك ازحف 🌚🍃 " 

ws[93] = "ّ" 
rs[93] = "ّ" 

ws[94] = "ّ" 
rs[94] = "ّ" 

ws[95] = "ّ" 
rs[95] = "ّ" 

ws[96] = "ّ" 
rs[96] = "ّ" 

ws[97] = "ّ" 
rs[97] = "ّ" 

ws[98] = "ّ" 
rs[98] = "ّ " 

ws[99] = "المنصور" 
rs[99] = " احلى ناس ولله " 

ws[100] = "المدرسه" 
rs[100] = " 😒🍃 الله لا يراوينه " 

ws[101] = "تحبني" 
rs[101] = " هوايه 😍🙈😍" 

ws[102] = "يعني شكد" 
rs[102] = " فوك متتوقع " 

ws[103] = "😂" 
rs[103] = " دوم حبي ❤️" 

ws[104] = "هههههه" 
rs[104] = " دوم حبي ❤️" 

ws[106] = "ههههه" 
rs[106] = " دوم حبي ❤️" 

ws[107] = "😹" 
rs[107] = " دوم حبي ❤️" 

ws[108] = "ّ" 
rs[108] = "ّ" 

ws[109] = "😍" 
rs[109] = " مح فديتك" 

ws[110] = "محح" 
rs[110] = " فوديتك❤️" 

ws[111] = "انمي" 
rs[111] = " اته اوتاكو ؟ ❤️" 

ws[112] = "منحرف" 
rs[112] = " وينه حطرده 🌚🌚" 

ws[113] = "😭" 
rs[113] = " 😢😢 لتبجي" 

ws[114] = "😢" 
rs[114] = "  لتبجي 😭😭" 

ws[115] = "شكد عمرك" 
rs[155] = "زاحفه 😂😂" 

ws[116] = "شكد عمرج" 
rs[116] = " زاحف 😂" 

ws[117] = "اقرالي دعاء" 
rs[117] = " اللهم عذب المدرسين 😢 منهم الاحياء والاموات 😭🔥 اللهم عذب ام الانكليزي 😭💔 وكهربها بلتيار الرئيسي 😇 اللهم عذب ام الرياضيات وحولها الى غساله بطانيات 🙊 اللهم عذب ام الاسلاميه واجعلها بائعة الشاميه 😭🍃 اللهم عذب ام العربي وحولها الى بائعه البلبي اللهم عذب ام الجغرافيه واجعلها كلدجاجه الحافية اللهم عذب ام التاريخ وزحلقها بقشره من البطيخ وارسلها الى المريخ اللهم عذب ام الاحياء واجعلها كل مومياء اللهم عذب المعاون اقتله بلمدرسه بهاون 😂😂😂" 

ws[118] = "غبي" 
rs[118] = " انته الاغبى" 

ws[119] = "دي" 
rs[119] = " هاي عود انته جبير 😐😂" 

ws[120] = "منو حبيبك" 
rs[120] = " اختك 🙈" 

ws[121] = "تكرهني" 
rs[121] = " يي 😈" 

ws[122] = "اكرهك" 
rs[122] = " علساس اني احبك تهي بهي 😒🍃" 

ws[123] = "😂" 
rs[123] = " دوم حبي ❤️" 

ws[124] = "الاعظمية" 
rs[124] = " احسن ناس وربي❤️" 

ws[125] = "الكرادة" 
rs[125] = " احسن ناس وربي❤️" 

ws[126] = "شارع فلسطين" 
rs[126] = " احسن ناس وربي❤️" 

ws[127] = "ببكن ملف" 
rs[127] = " دي تحلم 😒😒" 

ws[128] = "😇" 
rs[128] = "  اته مو ملاك اته جهنم بنفسهه 😂" 

ws[129] = "😐" 
rs[129] = " شبيك صافن 😒🔥" 

ws[130] = "انجب" 
rs[130] = " وك 😢😞" 

ws[131] = "حارة" 
rs[131] = "يي كولش 😭🍃🔥" 

ws[132] = "خالتك" 
rs[132] = " راح اطردك لك 😒" 

ws[133] = "اطرد البوت" 
rs[133] = " راح ابقة احترمك❤️" 

ws[134] = "هه" 
rs[134] = " شدتحس" 

ws[135] = "شدتحس" 
rs[135] = " داحس بيك" 

ws[136] = "اكولك" 
rs[136] = " لتكول 😐😂" 

ws[137] = "اكلك" 
rs[137] = " لتكول 😐😂" 

ws[138] = "بغداد" 
rs[138] = " 😍 فديتهه" 

ws[139] = "البصرة" 
rs[139] = " احسن ناس وربي❤️" 

ws[140] = "تركماني" 
rs[140] = " والنعم منك❤️" 

ws[141] = "يا سورس هذا" 
rs[141] = "الــــزعـــيـــــم >@TH3BOSS" 

ws[142] = "باي" 
rs[142] = " بايات ❤️🍃" 

ws[143] = "تنح" 
rs[143] = "عيب ابني 😒🍃" 

ws[144] = "جوعان" 
rs[144] = "تعال اكلني 😐😂" 

ws[145] = "عطشان" 
rs[145] = "روح اشرب مي" 

ws[146] = "صايم" 
rs[146] = "شسويلك 😐🍃" 

ws[147] = "☹️" 
rs[147] = "لضوج حبيبي 😢❤️🍃" 

ws[148] = "😔" 
rs[148] = " ليش الحلو ضايج ❤️🍃" 

ws[149] = "فرخ" 
rs[149] = " عيبب 😱😱" 

ws[150] = "كسمك" 
rs[150] = " عيب 😱😱😱" 

ws[151] = "نعال" 
rs[151] = " بوجهك 😐😂" 

ws[152] = "حروح اسبح" 
rs[152] = " واخيراً 😂" 

ws[153] = "حروح اغسل" 
rs[153] = " واخيراً 😂" 

ws[154] = "حروح اطب للحمام" 
rs[154] = " واخيراً 😂" 

ws[155] = "حبيبتي" 
rs[155] = " منو هاي 😱 تخوني 😔☹" 

ws[156] = "كبلت" 
rs[156] = " بلخير 😂💔" 

ws[157] = "البوت عاوي" 
rs[157] = " اطردك ؟ 😒" 

ws[158] = "منور" 
rs[158] = " بنورك حبي 😍🍷" 

ws[159] = "حفلش" 
rs[159] = " افلش راسك" 

ws[160] = "كردي" 
rs[160] = "والنعم منك ❤️" 

ws[161] = "طفي السبلت" 
rs[161] = " تم اطفاء السبلت بنجاح 🌚🍃" 

ws[162] = "🌝" 
rs[162] = "هه" 

ws[163] = "اذن المغرب" 
rs[163] = "استحرم 🌚🍃" 

ws[164] = "حلو" 
rs[164] = "انت الاحلى 🌚❤️" 

ws[165] = "🌚" -- msg 
rs[165] = "منور صخام الجدر 😹☝" -- rep 

ws[166] = "غني" -- msg 
rs[166] = "عــمــي يــبــو الــبــار 🍾🍾 صــبــلــي لــبــلــبــي 🍲🍲 تــرا انــي ســكــران😴🤕 وصــايــر عــصــبــي 😡😡 انــا ويــاچ يــم شــامــه👫" 

ws[167] = "غنيي" -- msg 
rs[167] = "لا تظربني لا تظرب 💃💃 كسرت الخيزارانه💃🎋 صارلي سنه وست اشهر💃💃 من ظربتك وجعانه🤒😹" 

ws[168] = "نونة" -- msg 
rs[168] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[169] = "ضحى" -- msg 
rs[169] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[170] = "لولو" -- msg 
rs[170] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[171] = "هدى" -- msg 
rs[171] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[172] = "زوزو" -- msg 
rs[172] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[173] = "زينة" -- msg 
rs[173] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[174] = "بنو" -- msg 
rs[174] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[175] = "بنين" -- msg 
rs[175] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[176] = "شغال" -- msg 
rs[176] = "  يـاب 😻  " -- reply 

-- the main function 
function run( msg, matches ) 
   -- just a local variables that i used in my algorithm 
   local i = 0; local w = false 

   -- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
   -- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
   for k,v in pairs(ws) do 
      -- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
      if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
         -- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
         i = k; w = true; 
      end 
   end 

   -- check if { w } is not false and { i } not equals to 0 
   if ( (w ~= false) and (i ~= 0) ) then 
      -- get the receiver :3 
      R = get_receiver(msg) 
      -- send him the proper message from the index that { i } assigned to 
      --send_large_msg ( R , rs[i] ); 
      --send_reply(msg.id, rs[i]) 
      reply_msg(msg.id, rs[i], ok_cb, false ) 
   end 
   -- don't edit this section 
   if ( msg.text == "about" ) then 
      if ( msg.from.username == "TH3BOSS" ) then 
         R = get_receiver(msg) 
         send_large_msg ( R , "Made by @TH3BOSS" ); 
      end 
   end 

end 

-- made by { @TH3BOSS } 
do 
ws = {} 
rs = {} 

-- some examples of how to use this :3 
ws[1] = "هلاو" -- msg 
rs[1] =  "هلاوو99وووات نورت/ي ❤️🙈" -- reply 

ws[2] = "صادق" -- msg 
rs[2] = "هذا الي صنعني فديت ربه 🙈❤️" -- reply 

ws[3] = "شلونكم" -- msg 
rs[3] = "اني بالنسبة اليه دايح شوف بقيه الاعضااء 😂🖕" -- reply 

ws[4] = "ضوجة" -- msg 
rs[4] = "شي اكيد الكبل ماكو 😂 لو بعدك/ج مازاحف/ة 🙊😋" -- reply 

ws[5] = "هلو" -- msg 
rs[5] = "🌹 هــلــℌelℓoووات🌹عمـ°🌺°ــري🙊😋" -- reply 

ws[6] = "بوسني" -- msg 
rs[6] = "💋😍ممَمَِمَِمَِمَِمِمِحَ تشَلع شَفتَي🙈😘🙊😋" -- reply 

ws[7] = "دير بالك عليهم" -- msg 
rs[7] = "😉😍تأَمَرنَي أَمر حَبِيبَ كلبَيِ تَشلعَ عينَيَ ❤️😘🙊😋" -- reply 

ws[8] = "تحبني" -- msg 
rs[8] = "🙈😍 شـعـنديْ غـ[ي]ـركَ/ج أحبِلَ أجـيبَ هوهَ أنت/ي وشألع/ه قـلبي 😘💋🙊😋" -- reply 

ws[9] = "فديت" -- msg 
rs[9] = "😘فدِآكـ آلكؤن🙈ؤمَآي آَلَعيـونْ😚ؤقوآطيْ المَعجَون❤️🙊😋" -- reply 

ws[10] = "برب" -- msg 
rs[10] = "😉أخَذَ/ي رآَحَتكَ 👍🏼حبَيَبَ كلَبي😘️🙊😋" -- reply 

ws[11] = "😒" -- msg 
rs[11] = "😒شبيـــك /ج كـــالــب/ه 😡 خلقتـــك/ج ســـربـــوت/ه😒🌚" -- reply 

ws[12] = "اني" -- msg 
rs[12] = "انت🌚 واحــد😒 ملطلـــط😡مــــا تكعـــد وتسكت😂😘" -- reply 

ws[13] = "خنفشاري" -- msg 
rs[13] = "😘يـآ بَـعد❤️روَ,وح 😚خنفشاري🙈" -- 

ws[14] = "تخليني" -- msg 
rs[14] = "😅المكـــان عليـــك👆لــو عــلــي👈😏" -- reply 

ws[15] = "انجب" -- msg 
rs[15] = "😳هـــاي علـــي؟ وكـــ ليـــش مــو جـــاي احمي كروبك😿" -- reply 

ws[16] = "كلخره" -- msg 
rs[16] = "😈ايا منحرف/ه ايا سربـــوت/ه/😒" -- reply 

ws[17] = "😕" -- msg 
rs[17] = "عـــاوج حلكَك عليمــن اتعدله لو اعدلــه الــك😒" -- reply 

ws[18] = "احبك" -- msg 
rs[18] = "موت بيك/ج ڳـــلـبْɧèāȑŧـي.😘" -- reply 

ws[19] = "صخام" -- msg 
rs[19] = "😡بــوجــهــك😏مـلـطــلط😒" -- reply 

ws[20] = "بنيه" -- msg 
rs[20] = "😏واذا بــنــيــه🌚 مـــا تشـــوفــيـن😒 شــون الله مطـيــح حظج😈" -- reply 

ws[21] = "انت ياهو يمك" -- msg 
rs[21] = "😏كــبــر🌚 را ســـك😒 وكـمــت تتعيقل علي😈" -- reply 

ws[22] = "تحب جوجو" -- msg 
rs[22] = "لك أّمُِـٍْـّْწყღწــًوت عليه احبه اكثر منك😼💔" -- reply 

ws[23] = "لابو ابوكم لابو تي ان تي" -- msg 
rs[23] = "انجب حشري🍃😹" -- reply 

ws[24] = "هههه" -- msg 
rs[24] = "😘❤️دووووم ❤️الضحكه 😂🙈" -- reply 

ws[25] = "😳" -- msg 
rs[25] = "🌚شـبــيــك😒مصـــدوم🌝وجـــه التنــكـــه😏" -- reply 

ws[26] = "حموده" -- msg 
rs[26] = "❤️فـــطــيــت😘ضــحـــكـتــك😍خخخخ❤️" -- reply 

ws[27] = "محمد" -- msg 
rs[27] = "اخـہـخ 😨 صـہـاككے اڵـہـكڕۆب 🙈 ۿـہـۮا 🏻️  💜😻" -- reply 

ws[28] = "مرحبا" -- msg 
rs[28] = "😻مـــراحــب😘عم🌺ري🤓" -- reply 

ws[29] = "حسن" -- msg 
rs[29] = "صـ😻ــاك الكـgяθυρـٍْـْْروب 🌚🌹" -- reply 

ws[30] = "حسوني" -- msg 
rs[30] = "صـ😻ــاك الكـgяθυρـٍْـْْروب 🌚🌹" -- reply 

ws[31] = "حيدر" -- msg ء سثس4ء سثس4 
rs[31] = "مــعـ😻ــذب الكـgяθυρـٍْـْْروب 🌚🌹" -- replyءق يلائ  ءق ي 

ws[32] = "حسون" -- msg 
rs[32] = "صـ😻ــاك الكـgяθυρـٍْـْْروب 🌚🌹" -- reply 

ws[33] = "🍃😹" -- msg 
rs[33] = "😹داحــســـك😹بــزونـــه😹" -- reply 

ws[34] = "اندعيلي" -- msg 
rs[34] = "كـــون تــمــوت😈🌚" -- reply 

ws[35] = "امريكي" -- msg 
rs[35] = "مــجــنــنـ😻كــم فــــ❤️يـــتـــه 🌚🌹" -- reply 

ws[36] = "حيدوري" -- msg 
rs[36] = "😅يــمـــه😂 الـــحـــب❤️  يــمـــه😘" -- reply 

ws[37] = "منتظر" -- msg 
rs[37] = "نظوري نوتيلا والباقي نستله ام الربع😻🍃" -- reply 

ws[38] = "عمروش" -- msg 
rs[38] = "مــجــنــنـ😻كــم فــــط❤️يـــتـــه 🌚🌹" -- reply 

ws[39] = "فوفه" -- msg 
rs[39] = "😍فوفه نوتيلا والباقي نستله ام الربع😻🍃" -- reply 

ws[40] = "نستله" -- msg 
rs[40] = "😋ايــبـــاه🎈نـــــوبــه 🐹بــس مــال🎈 اكــل😋" -- rep 

ws[41] = "تمام" -- msg 
rs[41] = "⌣{دِْۈۈۈۈ/يّارٌبْ_مـْو_يـّوّمٌ/ۈۈۈۈمْ}⌣" -- rep 

ws[42] = "دوم" -- msg 
rs[42] = "⌣{وجيري😅🐀ْ}⌣" -- rep 

ws[43] = "منور" -- msg 
rs[43] = "نِْـِْـــِْ([💡])ِْــــًِـًًْـــِْـِْـِْـورِْكِْ" -- rep 

ws[44] = "ها" -- msg 
rs[44] = "هاي اچون چقله هاي🌚" -- rep 

ws[45] = "شكرا" -- msg 
rs[45] = "{ •• الـّ~ـعـفو •• }" -- rep 

ws[46] = "وينك" -- msg 
rs[46] = "بالــســ🚗ــيــارﮭﮧ" -- rep 

ws[47] = "انته وين" -- msg 
rs[47] = "بالــبــ🏠ــيــت" -- rep 

ws[48] = "وين" -- msg 
rs[48] = "بالــســ🚗ــيــارﮭﮧ" -- rep 

ws[49] = "بوسه" -- msg 
rs[49] = "امــہـ😘😚😘😚😘ــہــواااااح" -- rep 

ws[50] = "السلام عليكم" -- msg 
rs[50] = "ۆعلـِْ♡̨̐ـِْيگمَ آلسَـِْ♡̨̐ـِْامَ" -- reply 

ws[51] = "طن" -- msg 
rs[51] = "كش عاع🌚️🏻" -- reply 

ws[52] = "زاحف" -- msg 
rs[52] = "زاحف ع اختك مثلا🏽️" -- reply 

ws[53] = "اتفل" -- msg 
rs[53] = "خخخخـ😩ـخخخ تفـ💦ـووووو💦💦" -- reply 

ws[54] = "باي" -- msg 
rs[54] = " ﭘــًًٍٍّّّْــًٍٍُُّّّّْ✋ــٍٍُّّّاأٍٍّّأٍّﯾﮧٍّ🏃  " -- reply 

ws[55] = "بوت" -- msg 
rs[55] = "مازا تريد منه🙄🍃" -- reply 

ws[56] = "اتفل" -- msg 
rs[56] = "خخخخـ😩ـخخخ تفـ💦ـووووو💦💦" -- reply 

ws[57] = "علي" -- msg 
rs[57] = "مــجــنــنـ😻كــم فــــ❤️يـــتـــه 🌚🌹" -- reply 

ws[58] = "عمر" -- msg 
rs[58] = "اخـہـخ 😨 صـہـاككے اڵـہـكڕۆب 🙈 ۿـہـۮا 🏻️  💜😻" -- reply 

ws[59] = "سامو" -- msg 
rs[59] = "اشـش كــــول عــــمــــو ســامــو 🌚🚶🏻" -- reply 

ws[60] = "علشلش" -- msg 
rs[60] = "العشق فديت ربه 🌚🚶🏻" -- reply 

ws[60] = "صدوقي" -- msg 
rs[61] = "العشق مالتي يعني الصنعني فديته❤️" -- reply 

ws[62] = "😂😂😂" 
rs[62] =  "😉لتضحك هوايه✋🏿يصير فاول😂🌚" 

ws[63] = "ّ" -- msg 
rs[63] = "ّ️" -- reply 

ws[64] = "اشلونكم" -- msg 
rs[64] = "الحمدلله وانته 🌚🍃" -- reply 

ws[65] = "دووم" -- msg 
rs[65] = "يدوم نبضك ❤️🍃" -- reply 

ws[66] = "شونك" 
rs[66] = "الحمدلله وانته" 

ws[67] = "اشلونك" 
rs[67] = "الحمدلله وانته" 

ws[68] = "خنفشاري اتحبني" 
rs[68] = " 🙈 احبك اني  🙊 اني احبك 🙉 واتحدى واحد بلبشر مثلي يحبك 🙊" 

ws[69] = "شغل المبردة" 
rs[69] = " تم تشغيل المبردة بنجاح ❄️" 

ws[70] = "طفي المبردة" 
rs[70] = "طفيتهه 😒🍃" 

ws[71] = "شغل السبلت" 
rs[71] = "شغلته 🌚🍃 بس حثلجون معليه ترا " 

ws[72] = "مايا خليفه" 
rs[72] = " 😂 عيب صايمين" 

ws[73] = "فطور" 
rs[73] = "واخيراً ��😍 خل اروح افطر " 

ws[74] = "احبج" 
rs[74] = "ها ولك زاحف😡 مو البارحه شفتك كلت لبنيه احبج🌚 وهسه تكول لغيرها كبر لفك😒🖕" 

ws[75] = "ّ" 
rs[75] = "ّ  " 

ws[76] = "تخليني" 
rs[76] = " 😂 يي امين ابدي " 

ws[77] = "زاحففف" 
rs[77] = "😂�� هاي عود انته جبير" 

ws[78] = "تركيا" 
rs[78] = "😐🍃 فديتهه" 

ws[79] = "داعش" 
rs[79] = "دي خل يولون 😒❤️" 

ws[80] = "الدولة الاسلامية" 
rs[80] = "انته داعشي ؟؟ 😒💔" 

ws[81] = "سني" 
rs[81] = "لتصير طائفي 😒🖐" 

ws[82] = "شيعي" 
rs[82] = "لتصير طائفي 😕" 

ws[83] = "تبادل" 
rs[83] = "كافي ملينه 😒😒 ما اريد اتبادل" 

ws[84] = "العراقيين" 
rs[84] = "احلى ناس ولله 😍🙈" 

ws[85] = "من وين" 
rs[85] = "شعليك زاحف 😂🔥 " 

ws[86] = "هاي" 
rs[86] = "هايات 🙈🍷" 

ws[87] = "البوت" 
rs[87] = "معاجبك ؟ 😕😒🍃" 

ws[88] = "البوت واكف" 
rs[88] = "لتجذب 😒" 

ws[89] = "منو ديحذف رسائلي" 
rs[89] = "محد 😐🍃" 

ws[90] = "كلاش اوف كلانس" 
rs[90] = "تلعبهه ؟ شكد لفلك ؟" 

ws[91] = "جوني" 
rs[91] = "😂 مأذيك ؟" 

ws[92] = "ازحف " 
rs[92] = " على اختك ازحف 🌚🍃 " 

ws[93] = "عير" 
rs[93] = "بكس اختك🌚👌" 

ws[94] = "خنفشاري نام" 
rs[94] = "لا وربك مانام بس مرات يغلبني نعاس😢😂" 

ws[95] = "غنيلي" 
rs[95] = "صوتي محلو خاف تطفر الاعضاء😹✋" 

ws[96] = "نتواعد" 
rs[96] = "عيب استحي اهلي يخافون علي🙄🙈" 

ws[97] = "بوس عمك" 
rs[97] = "ويع😖تخبلت بس اني بايس واحد اجكم😂☝️" 

ws[98] = "عفاف" 
rs[98] = "يمه😰الحب❤️يمه😍" 

ws[99] = "المنصور" 
rs[99] = " احلى ناس ولله " 

ws[100] = "المدرسه" 
rs[100] = " 😒🍃 الله لا يراوينه " 

ws[101] = "تحبني" 
rs[101] = "🙈😍شعندي غًيرك احبل اجيب هوه انت/ي وشالع/ه كلبي 😘💋" 

ws[102] = "يعني شكد" 
rs[102] = " فوك متتوقع " 

ws[103] = "😂" 
rs[103] = " دوم حبي ❤️" 

ws[104] = "هههههه" 
rs[104] = " دوم حبي ❤️" 

ws[106] = "ههههه" 
rs[106] = " دوم حبي ❤️" 

ws[107] = "😹" 
rs[107] = " دوم حبي ❤️" 

ws[108] = "حمودي" 
rs[108] = "اخخ😨 صاك الكروب هذا😍🙈" 

ws[109] = "😍" 
rs[109] = " مح فديتك" 

ws[110] = "محح" 
rs[110] = " فوديتك❤️" 

ws[111] = "انمي" 
rs[111] = " اته اوتاكو ؟ ❤️" 

ws[112] = "منحرف" 
rs[112] = " وينه حطرده 🌚🌚" 

ws[113] = "😭" 
rs[113] = " 😢😢 لتبجي" 

ws[114] = "😢" 
rs[114] = "  لتبجي 😭😭" 

ws[115] = "شكد عمرك" 
rs[155] = "زاحفه 😂😂" 

ws[116] = "شكد عمرج" 
rs[116] = " زاحف 😂" 

ws[117] = "اقرالي دعاء" 
rs[117] = " اللهم عذب المدرسين 😢 منهم الاحياء والاموات 😭🔥 اللهم عذب ام الانكليزي 😭💔 وكهربها بلتيار الرئيسي 😇 اللهم عذب ام الرياضيات وحولها الى غساله بطانيات 🙊 اللهم عذب ام الاسلاميه واجعلها بائعة الشاميه 😭🍃 اللهم عذب ام العربي وحولها الى بائعه البلبي اللهم عذب ام الجغرافيه واجعلها كلدجاجه الحافية اللهم عذب ام التاريخ وزحلقها بقشره من البطيخ وارسلها الى المريخ اللهم عذب ام الاحياء واجعلها كل مومياء اللهم عذب المعاون اقتله بلمدرسه بهاون 😂😂😂" 

ws[118] = "غبي" 
rs[118] = " انته الاغبى" 

ws[119] = "دي" 
rs[119] = " هاي عود انته جبير 😐😂" 

ws[120] = "منو حبيبك" 
rs[120] = " اختك 🙈" 

ws[121] = "تكرهني" 
rs[121] = " يي 😈" 

ws[122] = "اكرهك" 
rs[122] = " علساس اني احبك تهي بهي 😒🍃" 

ws[123] = "😂" 
rs[123] = " دوم حبي ❤️" 

ws[124] = "الاعظمية" 
rs[124] = " احسن ناس وربي❤️" 

ws[125] = "الكرادة" 
rs[125] = " احسن ناس وربي❤️" 

ws[126] = "شارع فلسطين" 
rs[126] = " احسن ناس وربي❤️" 

ws[127] = "ببكن ملف" 
rs[127] = " دي تحلم 😒😒" 

ws[128] = "😇" 
rs[128] = "  اته مو ملاك اته جهنم بنفسهه 😂" 

ws[129] = "😐" 
rs[129] = " شبيك صافن 😒🔥" 

ws[130] = "انجب" 
rs[130] = " وك 😢😞" 

ws[131] = "حارة" 
rs[131] = "يي كولش 😭🍃🔥" 

ws[132] = "خالتك" 
rs[132] = " راح اطردك لك 😒" 

ws[133] = "اطرد البوت" 
rs[133] = " راح ابقة احترمك❤️" 

ws[134] = "هه" 
rs[134] = " شدتحس" 

ws[135] = "شدتحس" 
rs[135] = " داحس بيك" 

ws[136] = "اكولك" 
rs[136] = " لتكول 😐😂" 

ws[137] = "اكلك" 
rs[137] = " لتكول 😐😂" 

ws[138] = "بغداد" 
rs[138] = " 😍 فديتهه" 

ws[139] = "البصرة" 
rs[139] = " احسن ناس وربي❤️" 

ws[140] = "تركماني" 
rs[140] = " والنعم منك❤️" 

ws[141] = "يا سورس هذا" 
rs[141] = "معليك😛" 

ws[142] = "باي" 
rs[142] = "تعال وين رايح الله وياك😅👋" 

ws[143] = "تنح" 
rs[143] = "عيب ابني 😒🍃" 

ws[144] = "جوعان" 
rs[144] = "تعال اكلني 😐😂" 

ws[145] = "عطشان" 
rs[145] = "روح اشرب مي" 

ws[146] = "صايم" 
rs[146] = "شسويلك 😐🍃" 

ws[147] = "☹️" 
rs[147] = "لضوج حبيبي 😢❤️🍃" 

ws[148] = "😔" 
rs[148] = " ليش الحلو ضايج ❤️🍃" 

ws[149] = "فرخ" 
rs[149] = " عيبب 😱😱" 

ws[150] = "كسمك" 
rs[150] = " عيب 😱😱😱" 

ws[151] = "نعال" 
rs[151] = " بوجهك 😐😂" 

ws[152] = "حروح اسبح" 
rs[152] = " واخيراً 😂" 

ws[153] = "حروح اغسل" 
rs[153] = " واخيراً 😂" 

ws[154] = "حروح اطب للحمام" 
rs[154] = " واخيراً 😂" 

ws[155] = "حبيبتي" 
rs[155] = " منو هاي 😱 تخوني 😔☹" 

ws[156] = "كبلت" 
rs[156] = " بلخير 😂💔" 

ws[157] = "البوت عاوي" 
rs[157] = " اطردك ؟ 😒" 

ws[158] = "منور" 
rs[158] = " بنورك حبي 😍🍷" 

ws[159] = "حفلش" 
rs[159] = " افلش راسك" 

ws[160] = "كردي" 
rs[160] = "والنعم منك ❤️" 

ws[161] = "طفي السبلت" 
rs[161] = " تم اطفاء السبلت بنجاح 🌚🍃" 

ws[162] = "🌝" 
rs[162] = "هه" 

ws[163] = "اذن المغرب" 
rs[163] = "استحرم 🌚🍃" 

ws[164] = "حلو" 
rs[164] = "انت الاحلى 🌚❤️" 

ws[165] = "🌚" -- msg 
rs[165] = "منور صخام الجدر 😹☝" -- rep 

ws[166] = "غني" -- msg 
rs[166] = "عــمــي يــبــو الــبــار 🍾🍾 صــبــلــي لــبــلــبــي 🍲🍲 تــرا انــي ســكــران😴🤕 وصــايــر عــصــبــي 😡😡 انــا ويــاچ يــم شــامــه👫" 

ws[167] = "غنيي" -- msg 
rs[167] = "لا تظربني لا تظرب 💃💃 كسرت الخيزارانه💃🎋 صارلي سنه وست اشهر💃💃 من ظربتك وجعانه🤒😹" 

ws[168] = "فوف" -- msg 
rs[168] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[169] = "ضحى" -- msg 
rs[169] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[170] = "لولو" -- msg 
rs[170] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[171] = "هدى" -- msg 
rs[171] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[172] = "زوزو" -- msg 
rs[172] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[173] = "زينة" -- msg 
rs[173] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[174] = "بنو" -- msg 
rs[174] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[175] = "بنين" -- msg 
rs[175] = "اخـہـخ 😨 صـہـاككه اڵـہـكڕۆب 🙈 هاية 🏻️  �💜�" -- reply 

ws[176] = "شغال" -- msg 
rs[176] = "  يـاب 😻  " -- reply 

-- the main function 
function run( msg, matches ) 
   -- just a local variables that i used in my algorithm 
   local i = 0; local w = false 

   -- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
   -- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
   for k,v in pairs(ws) do 
      -- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
      if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
         -- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
         i = k; w = true; 
      end 
   end 

   -- check if { w } is not false and { i } not equals to 0 
   if ( (w ~= false) and (i ~= 0) ) then 
      -- get the receiver :3 
      R = get_receiver(msg) 
      -- send him the proper message from the index that { i } assigned to 
      --send_large_msg ( R , rs[i] ); 
      --send_reply(msg.id, rs[i]) 
      reply_msg(msg.id, rs[i], ok_cb, false ) 
   end 
   -- don't edit this section 
   if ( msg.text == "about" ) then 
      if ( msg.from.username == "TH3BOSS" ) then 
         R = get_receiver(msg) 
         send_large_msg ( R , "Made by @TH3BOSS" ); 
      end 
   end 

end 

return { 
   patterns = { 
      "(.*)" 
     }, 
     run = run 
} 

end 

return { 
   patterns = { 
      "(.*)" 
     }, 
     run = run 
} 

end 
